{"Berücksichtigen": [" to consider something, to regard, to allow for something"], "Abschluss": [" launch, drown"], "Entsprechende": [" corresponding"], "Umstellung": [" conversion, migration, changeover, switch etc"], "Führen": [" to manage, to lead, to guide, to operate"], "Einzelheiten": [" details ", " Bitte können Sie mir Einzelheiten über Flüge nach London geben."], "Anpassungsfahigkeit": [" adaptability, resilience, flexibility. ", " Ich bin überzeugt, daß ich bei meiner Anpassungsfahigkeit die Umstellung gut schaffen würde."], "Vorschlag": [" Suggestion. Mein Vorschlag wäre ...."], "anstoßen": [" to bump, to shove .. to drink a toast to something or somebody. „Ich habe heute meinen Arbeitsvertrag für meine neue Arbeitsstelle unterschrieben! Darauf müssen wir anstoßen!“"], "die Tätigkeit": [" activity, tasks, occupation. Ich finde meine berufliche Tätigkeit sehr interessant. Es gibt immer etwas Neues."], "Tatem": [" doings, actions. wir taten, wie uns befohlen wurde (We did as we were told)."], "Zugehörigkeit": [" affinity, belonging, membership"], "Beziehung": [" relationship, connection. Wir haben gute Beziehungen zu unseren Nachbarn."], "vorwiegend": [" predomainatly, mainly, principally. ", " Entwicklung von Software bzw. Software Architekturen, vorwiegend mit C++ oder C#"], "verzögern": [" to stall, to delay, to defer ", " Alle diese Umstände hatten den Reiseverlauf verzögert."], "Reiseverlauf": [" itinerary ", " Alle diese Umstände hatten den Reiseverlauf verzögert."], "Umstände": [" circumstances, conditions ", " Alle diese Umstände hatten den Reiseverlauf verzögert."], "nachgeben": [" to give in, to concede, to yield. ", " Gebt diesen Forderungen nicht nach"], "fehlerhaft": [" faulty, incorrect, defective, flawed ", " Das Festplattenlaufwerk ist fehlerhaft und muss ersetzt werden. ", " Das Prinzip ist jedoch offenkundig fehlerhaft. (The prinicple is however patently flawed)."], "vorangeschritten": [" advanced, progressed ", " So weit sind die Arbeiten in Brandenburg vorangeschritten ", " Dieser Prozess ist enttäuschend langsam vorangeschritten. (The process has advanced disappointingly slow)"], "überstehen": [" withstand, survive, overcome, get through ", " Mit der staatlichen Soforthilfe, dachte Musikerin Vera Klima, sei diese Coronakrise schon zu überstehen."], "die Auftritte": [" apperances (acts), performances"], "Einkommensverlust": [" loss of income"], "Das Rätsel": [" puzzle, mystery, riddle."], "gering": [" adj/adv small, low, meagre ", " Ihre Chancen sind gering. (Your chances are low)"], "verteidigen": [" to defend, to advocate, to answer for somebody ", " ein Prinzip verteidigen (to defend a principle) ", " eine These verteidigen (to defend a theses)"], "wahren (verb), wahr (adj)": [" wahren -> maintain, preserve, safeguard, retain/keep etc. ", " Er ist ein guter Freund, weil er Geheimnisse wahren kann. ( He is a good friend because he can keep secrets) ", " wahr -> true, real ", " Er war ein wahrer Fan und ging zu allen Spielen der Mannschaft.( He is a true fan and goes to every game of the team). ", " Das ist nicht wahr. (That is not true)"], "vielfältig": [" adj diverse, manifold, ", "Die möglichen Gründe für diese positive Entwicklung sind vielfältig. (The possible reasons for this positive development are manifold)"], "Großveranstaltungen": [" big events, large events"], "Tonaufnahmen": [" sound recordings."], "Ehrung": [" tribute"], "Opfer": [" victim"], "der Verdacht": [" suspision"], "verschärfen": [" aggravate, intesify, exacerbate, sharpen, get worse* ", " Politische Korruption verschärft die Armut im Land. ", " Political corruption exacerbates the country's poverty. ", "Immerhin hat sich das Problem nicht verschärft. ", " At least the problem has not gotten worse."], "immerhin": [" atleast, though"], "Dutzenden": [" plural of Dutzend (dozen) ", " Er kaufte ein Dutzend Eier. ", "He bought a dozen eggs."], "beigetragen": [" contributed, added ", " Alle Mitarbeiter haben zum Erfolg unseres Unternehmens beigetragen. ", " All employees have contributed to the success of our company."], "vermuten": [" speculate, assume, suspect, expect, guess ", " Ich vermutete, dass der Mann im Anzug der Manager war. I assumed the man in the suit was the manager. ", "Ich vermutete einen Motorschaden und wendete mich an den Kundendienst. I suspected engine damage and contacted customer service.", "Ich vermute, dass er morgen ankommen wird. I expect that he will arrive tomorrow. ", " Es ist fast Mitternacht. Ich vermute, dass er nicht mehr kommt. It is almost midnight I guess he is not coming anymore.", "Ich kann nur vermuten, was sein Motiv gewesen sein könnte. I can only speculate what his motive may have been."], "bislang": [" sofar ", " Bislang hat unser Team alle Spiele gewonnen. So far our team has won all matches."], "der Gipfel": [" peak, summit ", " Der Gipfel des Berges war mit Schnee bedeckt. The peak of the mountain was covered with snow"], "Umsatz-Progonse": [" Sales forecast. ", " Zoom verdoppelt Umsatz-Prognose."], "Inzwichen": [" In the meantime ", " Inzwichen machen jedoch auch Anbieter wie Facebook und Google Zoom Konkurrenz. ", " In the meantime, however, providers such as facebook and Google are also competing."], "Angaben": [" Information ", " Ich bescheinige hiermit, dass die Angaben richtig sind (I hereby certify that the information is correct) ", " Angabe -> statement, specification, indication ", " Die Angaben im Handbuch sind ziemlich verwirrend. The specification listed in the manual are quite confusing."], "laut": [" prep. by, according to, as per ", " adj loud, noisy ", " Laut Prognosen werden die Umsaetze nächstes Jahr steigen."], "annähernd": [" approximate, almost, roughly ", " Das annähernde Gewicht dieses Auto beträgt drei Tonnen. The approximate weight of this car is three tonnes."], "weitgehend": [" adj. wide, to a great extent ", " adv. largely, widely ", " Unsere Kunden sind weitgehen zufrieden mit unseren Produkten. Our customers are largely satisfied with our products. ", " Unsere Anforderungen wurden weitgehend erfüllt. Our demands have been accepted to a great extent."], "Bestimmungen": [" regulations, clauses, stipulations, provisions. ", " Der Vertrag umfasst mehrere Bestimungen. The contract comprises of several clauses."], "Angehörige": [" relatives, members ", " Nur Freunde und enge Angehörige sind zur Hochzeit eingeladen. Only friends and close relatives are invited to the wedding."], "bewerben": [" promote, advertise ", " sich bewerben - make an application ", " Wir mussen unser neues produkt bewerben. ", " We must promote our new product."], "vergewaltigt, vergewaltigen": [" vergewaltigt - adj. raped ", " vergewaltigen - verb. rape, violate ", " Der Täter versuchte erfolglos, das Opfer zu vergewaltigen. ", " The perpetrator unsuccessfully tried to rape the victim."], "entbrannt": [" flared up, erupted", " Nach seiner umstrittenen Aussage entbrannte eine lebhafte Diskussion. ", " A lively discussion erupted following his controversial statement."], "unfassbar": [" incredible, inconceivable, mind-boggling. ", " Die tollen Tricks des Zauberers waren unfassbar. ", " The magicians amazing tricks were mind boggling."], "in Aussicht stellen": [" promise something ", " Der Bund hatte bereits in Aussicht gestellt, das Eigenkapital zu erhöhen. ", " The federal govt had already promised to increase the equity capital."], "gewähren": [" grant, award etc. ", " Der gütige König gewährte seiner Tochter den Wunsch. ", " The kind king granted his daughter's wish."], "Einnahme": [" income, earning, revenue etc. ", " Die Einnahmen der Firma sind erheblich gesteigen. ", " The revenue of the company increased considerably."], "zögerlich": [" adj. hesitant, adv. heistantly. ", " Der SPD war es ein großes Anliegen, die Union war eher zögerlich. The SPD wasa very keen on it, the CDU/CSU were rather hesitant."], "abzufedern": [" cushion (sth). Boxhandschuhe helfen, die Kraft der Schläge abzufedern. Boxing gloves help to cushion the force of the blows."], "verzichten": [" do without, give up, forego, waive, renounce. ", " Ich verzichte auf alle Rechte und Ansprüche. I waive all rights and claims. ", " Ich versuche, auf Süßigkeiten zu verzichten. I am trying to give up sweets. ", " Ich musste auf das Mittagessen verzichten, um das Projekt abzuschließen."], "geleistet": [" adj. achieved, rendered. ", " Glückwunsch, du hast eine Menge geleistet. Congratulations, you have achieved a lot."], "ausgegeben": [" spend, issue ", " Ich will nicht mein ganzes Geld für ein neueus Auto ausgeben. I don't want to spend all my money on a new car. ", " Die Universität gibt Stundentenausweise aus. The University issues student Identity cards."], "Schließlich": [" adj. eventual adv. finally, afterall, lastly, eventually, in the end ", " Der alte Computer wurde schließlich ersetzt. The old computer was finally replaced ", " Ich frage den Experten, er sollte es schließlich wissen. I'm asking the expert, after all he should know. ", " Seine Lügen wurden schließlich aufgedeckt. His lies were uncovered in the end. ", " Ich testete das Produkt, bevor ich es schließlich kaufte. I tested the product before I eventually bought it."], "angekündigt": [" announced, advertised. ", " Der Kurs trifft sich montags, wenn nicht anders angekundigt. The course meets on Mondays, unless announced otherwise."], "sich einigen": [" to agree on something, reach an agreement. ", " Die beteiligten Akteure einigten sich auf eine Lösung. The parties agreed on a solution."], "Entwurf": [" design, concept, plan, outline, draft etc ", " Den Anwohnen gefällt der Entwurf für den neueun Park. The residents like the concept of the new park ", " Der erste Entwurf des Brief ist fertig. The first draft of the letter is finished."], "Erlaubnis": [" permission, permit, authorization, leave. ", " Du solltest deinen Vater um Erlaubnis fragen. You must ask your father for permission. ", " Mein Chef gab mir die Erlaubnis, die Konference zu besuchen. My boss gave me leave to attend the conference."], "damals": [" adv. then, at the time, at that time. ", " Damals waren lange Rocke in Mode. Long skirts were in fashion then. ", " Damals war ich ein kleiner junge. At that time I was a small boy."], "Gelassenheit": [" calm, serenity, composure. ", " Wir bewundern ihre Ruhe und Gelassenheit in kritischen Situationen. We admire her calmness and composure in critical situations."], "Bedürfnis": [" need, desire ", " Wir tun alles, um die Bedürfnisse unserer Kundenn zu befriedigen. We do everything to satisfy our customers needs."], "erfreulich": [" pleasing, gratifying, enjoyable. ", " Die Reise war eine erfreuliche Erfahrung. The journey was an enjoyable experience. ", " Die Schwangerschaft meine  Schwester war eine erfreuliche Nachricht. My sisters pregnancy was a delightful announcement."], "zugleich": [" at the same time. ", " Er liest zwei Bücher zugleich. He is reading two books at the same time."]}